*** Create an 1 element dictionary with key x and value 1
    #+BEGIN_SRC q :exports both
      ele:  {enlist[x]!enlist 1} 
      ele "a"
    #+END_SRC

    #+RESULTS:
    : a| 1

** Get Part 1 Answer 
#+begin_src q :exports both 
  show t: read0 `:4.txt
#+end_src

#+RESULTS:
: "nzydfxpc-rclop-qwzhpc-qtylyntyr-769[oshgk]"
: "qzlozfhmf-bzmcx-bnzshmf-zbpthrhshnm-339[zmxdi]"
: "xtwtelcj-rclop-upwwjmply-zapcletzyd-743[itbds]"
: "mrxivrexmsrep-fewoix-ywiv-xiwxmrk-308[kzypw]"
: "ibghopzs-qobrm-difqvogwbu-142[lnrzo]"
: "irgyyolokj-xghhoz-lotgtiotm-228[vnmxd]"
: "foadouwbu-gqojsbusf-vibh-fsgsofqv-376[ymswi]"
: ..

#+BEGIN_SRC q :exports both
  sum 0N! parser each t 
#+END_SRC

#+RESULTS:
: 0 0 0 0 0 0 0 0 236 0 0 393 893 0 563 0 0 0 0 0 0 0 0 0 0 0 0 0 0 748 0 0 623..
: 158835i


